Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2263b10-6e57-46cf-b47e-55d2a0ece65c">
  <name>торо_ТиповыеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a539d3d0-780d-4225-9a49-5758a63c542a">
    <name>гкс_Модель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Статус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Качество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3c1c3c2d-feea-4d32-8161-3307cc6b0663">
    <name>гкс_КонструктивныйСостав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fe3986cf-990b-463d-b2d8-8fbd42506576">
      <name>Компонент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/УправлениеСвойствамиПереопределяемый/Module.bsl
#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз 1] Куст 17.03.2020
Процедура ДобавитьНаборыРодителей(Ссылка,НаборыСвойств)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТОР_Родитель1.НаборСвойствОР КАК Набор1,
		|	ТОР_Родитель1.Родитель.НаборСвойствОР КАК Набор2
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК ТОР_Родитель1
		|		ПО торо_ТиповыеОР.Родитель = ТОР_Родитель1.Ссылка
		|			И (торо_ТиповыеОР.Ссылка = &Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Выборка.Набор1;
			
			Если ЗначениеЗаполнено(Выборка.Набор2) Тогда 
				Строка = НаборыСвойств.Добавить();
				Строка.Набор = Выборка.Набор2;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз 1] Куст 17.03.2020

&ИзменениеИКонтроль("ЗаполнитьНаборСвойствДляОР")
Процедура Расш_гкс_ЗаполнитьНаборСвойствДляОР(торо_ОР, ТипСсылки, НаборыСвойств)

	Если торо_ОР.ЭтоГруппа = Ложь Тогда
		Если ЗначениеЗаполнено(торо_ОР.Направление) Тогда	
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.Направление, "НаборСвойствОР");
		КонецЕсли;

		// Общие реквизиты и сведения типового ОР для ОР будем добавлять если выбран хоть какой то типовой ОР.
		Если ЗначениеЗаполнено(торо_ОР.ТиповойОР) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ТиповыеОР_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(торо_ОР.ТиповойОР, "НаборСвойствОР");
			#Вставка
			ДобавитьНаборыРодителей(торо_ОР.ТиповойОР,НаборыСвойств);
			#КонецВставки
		КонецЕсли;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ОбъектыРемонта_Общие;
	КонецЕсли;		

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР")
Процедура Расш_гкс_ЗаполнитьНаборСвойствПоВидуНаправленийДляТиповыхОР(ТиповойОР, ТипСсылки, НаборыСвойств)

	#Удаление
	Если ТиповойОР.ЭтоГруппа = Ложь Тогда	
	#КонецУдаления
		Если ЗначениеЗаполнено(ТиповойОР.Направление) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_НаправленияОбъектовРемонтныхРабот_Общие;

			Строка = НаборыСвойств.Добавить();
			Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповойОР.Направление, "НаборСвойствОР");
		КонецЕсли;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_торо_ТиповыеОР_Общие;

		Строка = НаборыСвойств.Добавить();
		Строка.Набор = ТиповойОР.НаборСвойствОР;
	#Удаление
	КонецЕсли;
	#КонецУдаления

КонецПроцедуры

#КонецОбласти
